Repository: OmegaT-L10N/fi
Catalog: omegat/project_save.tmx
Source language: en
Languages: fi

source: Translated unique segments
fi: Käännettyjä uniikkeja segmenttejä

source: Translation
fi: Käännös

source: Translation Memory Files Folder
fi: Käännösmuistitiedostojen kansio

source: Translation Memory Folder:
fi: Käännösmuistikansio:

source: Translation last modified by {0} on {1} at {2}
fi: Käännöstä muokkasi viimeksi {0}, {1} klo {2}.

source: Translation memory files folder entered does not exist!
fi: Annettua käännösmuistitiedostojen kansiota ei ole!

source: Turkish
fi: turkki

source: Turkmen
fi: turkmeeni

source: Type
fi: Tyyppi

source: Types: Exact searches match the whole search string.
fi: Tyypit: Täsmähaut etsivät koko hakustringiä.

source: U&ntranslated
fi: Kääntämättä

source: UNL
fi: VAP

source: Uighur, Uyghur
fi: uiguuri

source: Ukrainian
fi: ukraina

source: Unable to build new TMX file!
fi: Uuden TMX-tiedoston luominen ei onnistu!

source: Unable to convert project!
fi: Projektin muuntaminen ei onnistu!

source: Unable to download team project!
fi: Ryhmäprojektin lataaminen ei onnistu!

source: Unable to initialize read of XML file!
fi: XML-tiedoston luvun alustus ei onnistu!

source: Unable to read file
fi: Tiedoston lukeminen ei onnistu

source: Unable to read project file!
fi: Projektitiedoston lukeminen ei onnistu!

source: Unable to save data.
fi: Tietojen tallentaminen ei onnistu.

source: Unauthorized request to TaaS service.
fi: Valtuuttamaton pyyntö TaaS-palvelulle.

source: Unexpected char {0} ({1})!
fi: odottamaton merkki {0} ({1})!

source: Unique Characters (including spaces)
fi: Uniikkeja merkkejä (sis. välilyönnit)

source: Unique Characters (without spaces)
fi: Uniikkeja merkkejä (ilman välilyöntejä)

source: Unique Remaining Characters (including spaces)
fi: Uniikkeja merkkejä jäljellä (sis. välilyönnit)

source: Unique Remaining Characters (without spaces)
fi: Uniikkeja merkkejä jäljellä (ilman välilyöntejä)

source: Unique Remaining Segments
fi: Uniikkeja segmenttejä jäljellä:

source: Unique Remaining Words
fi: Uniikkeja sanoja jäljellä:

source: Unique Remaining:
fi: Uniikkeja jäljellä:

source: Unique Segments
fi: Uniikkeja segmenttejä

source: Unique Words
fi: Uniikkeja sanoja

source: Unique segments
fi: Uniikkeja segmenttejä

source: Unique:
fi: Uniikkeja:

source: Unspecified
fi: Määrittelemätön

source: Unsupported XML version {0}!
fi: XML-versiota {0} ei tueta!

source: Untranslated segments
fi: Kääntämättömät segmentit

source: Untranslated segments text
fi: Kääntämättömien segmenttien teksti

source: Updated
fi: Päivitetty

source: Upgrading...
fi: Päivitetään…

source: Usage: java -jar OmegaT.jar [<options>] [<project path>]
fi: Käyttö: java -jar OmegaT.jar [<valinnat>] [<projektipolku>]

source: Usage: java -jar OmegaT.jar team <command> [<options>]]
fi: Käyttö: java -jar OmegaT.jar team <komento> [<asetukset>]]

source: Use $n to refer to the nth group.
fi: Käytä merkintää $n viittaamaan n:nteen ryhmään.

source: Use &Fuzzy Matching for Dictionary Entries
fi: Käytä sanakirjatietueiden s&umeita osumia

source: Use &TAB to Advance
fi: Siirry eteenpäin TA&B-näppäimellä

source: Use &fuzzy matching for dictionary entries
fi: Käytä sanakirjatietueiden s&umeita osumia

source: Use &stemming for glossary entries
fi: Käytä termilistan termeissä &vartaloita

source: Use all mine
fi: Käytä omia

source: Use all original
fi: Käytä alkuperäisiä

source: Use all updated
fi: Käytä päivitettyjä

source: Use glossary
fi: Käytä sanastoa

source: Use terms &appearing separately in the source text
fi: Käytä lähtötekstin &yksittäisiä termejä

source: Use the installation language in OmegaT
fi: Käytä OmegaT-asennuksen kieltä

source: Use untar utility (or its equivalent, for instance winrar in Windows) to extract its contents into the project folder "Dictionary".
fi: Pura (untar tai vastaava, esim. Windowsin winrar tiedoston sisältö projektin Dictionary-kansioon.

source: User group
fi: Käyttäjäryhmä

source: User interface language for OmegaT
fi: OmegaT-käyttöliittymän kieli

source: User manuals
fi: [fuzzy]&Käyttöopas...

source: Using TaaS in OmegaT
fi: TaaS-palvelun käyttäminen OmegaT:ssä

source: Uzbek
fi: uzbekki

source: Version: {0}
fi: Versio: {0}

source: Vietnamese
fi: vietnam

source: Walloon
fi: valloni

source: Warn: Report invalid tags to stdout.
fi: Warn: Tulostaa virheelliset tägit standarditulosteeseen.

source: Warning
fi: Varoitus

source: Warning!
fi: Varoitus!

source: Warranty
fi: Takuu

source: We could not find the page you are looking for.
fi: Etsimääsi sivua ei löytynyt.

source: WebVTT Subtitles
fi: WebVTT-tekstitys

source: Website content authors
fi: Sivuston sisällön tekijät

source: Website design
fi: Nettisivujen suunnittelu

source: Website manager
fi: Nettisivupäällikkö

source: Welsh
fi: kymri

source: Western Frisian
fi: länsifriisi

source: Whatever the inconsistencies, omissions and straightforward errors you may find in the present version, I declare them all my own.
fi: Kaikki epäjohdonmukaisuudet, puutteet ja suoranaiset virheet, joita tästä versiosta voi löytyä, ovat omaa tuotostani.

source: When a rule is triggered, the corresponding phrase will be underlined in blue in the Editor (see also and I didn't do nothing in the picture above).
fi: Sääntöä vastaava lauseke näkyy muokkausruudussa sinisellä alleviivattuna (ks. also ja I didn't do nothing yllä olevassa kuvassa).

source: When checked, the items in the glossary auto-completer view will contain the source text, too.
fi: Kun tämä on valittuna, termistön automaattisen täydennyksen valintaikkunassa näkyy myös lähdekielinen teksti.

source: When hovering the mouse over the underlined phrase, an explanation will appear.
fi: Vie osoitin alleviivatun lausekkeen yläpuolelle, niin saat näkyviin selityksen.

source: When using regular expressions, the replacement string supports references to groups defined in the search string.
fi: Tekstin korvaamisessa voi käyttää säännöllisiä lausekkeita, jolloin korvattavassa tekstissä voi viitata hakulausekkeessa määriteltyihin ryhmiin.

source: Whitespace
fi: Tyhjätila

source: Whitespaces
fi: Tyhjätilamerkit

source: Wildcards: Both exact and keyword searches support the wildcard characters * and ?.
fi: Jokerimerkit: Sekä täsmähaussa että avainsanahaussa voidaan käyttää jokerimerkkejä * ja ?.

source: Will Helton: his final reading of the draft has spared me a lot of embarrassment.
fi: Will Heltonia luonnoksen lopullisesta oikoluvusta, sillä se säästi minut monelta nolostumiselta.

source: Words
fi: Sanoja

source: Working with plain text
fi: Tekstitiedostojen kanssa työskentely

source: Writeable Glossary File
fi: Kirjoituskelpoinen termilistatiedosto

source: Writeable Glossary File:
fi: Kirjoituskelpoinen termilistatiedosto:

source: Writeable glossary file folder entered does not exist!
fi: Annettua kirjoituskelpoisen termilistan kansiota ei ole!

source: Wrong response format from TaaS service
fi: TaaS-palvelun vastauksen muoto on väärä.

source: XLIFF Filter Options
fi: XLIFF-suodattimen asetukset

source: Yiddish
fi: jiddiš

source: Yoruba
fi: joruba

source: You are an OmegaT user and are requested by a customer to deliver a translation in Déjà Vu's file format.
fi: Käyttämäsi CAT-ohjelma on OmegaT, mutta asiakas pyytää sinua palauttamaan käännöksen Déjà Vu -ohjelman tiedostomuodossa

source: You are going to modify {0} segments.
fi: Olet muokkaamatta {0} segmettiä.

source: You are running OmegaT version {0}.
fi: Käytössäsi on OmegaT:n versio {0}.

source: You are trying to use the HunspellTokenizer with the language {0}, but no spelling dictionaries are installed for this language.
fi: HunspellTokenizer-jäsennystoiminto ei toimi kielessä {0}, sillä tälle kielelle ei ole asennettu oikolukusanakirjaa.

source: You can find detailed statistic information in the file: {0}
fi: Yksityiskohtaista tilastotietoa löytyy tiedostosta {0}

source: You can go to the home page and hopefully find the information you need from there.
fi: Voit palata kotisivulle, toivottavasti löydät tarvitsemasi tiedon sieltä.

source: You can think of LanguageTool as a software to detect errors that a simple spell checker cannot detect, e.g. mixing up there/their, no/now etc.
fi: LanguageTool-sovellus paljastaa virheitä, joita yksinkertainen oikeinkirjoituksen tarkastin ei huomaa, esim. kun there/their tai no/now ovat menneet sekaisin.

source: You may also copy the files to your project's 'source' folder using your favorite file manager and reload the project by calling Reload from the Project menu.
fi: Voit kopioida tiedostoja projektin lähdetekstikansioon (/source) myös tiedostonhallintaohjelmassa. Lataa tämän jälkeen projekti uudelleen (Projekti-valikko > Lataa uudelleen).

source: You may try to solve this problem in one of the following ways:
fi: Seuraavassa on tapoja ratkaista tämä ongelma:

source: You must enter a number between 1 and {0}.
fi: Numeron on oltava 1 ja {0} väliltä.

source: You should specify their new location or recreate them.
fi: Osoita niiden uusi sijainti tai luo ne uudestaan.

source: YouTube Subtitles
fi: YouTube-tekstitys

source: Your current project uses sentence segmentation, but TMX file was created using paragraph segmentation.
fi: Tämänhetkinen projekti on segmentoitu lauseittain, mutta TMX-tiedostossa on käytössä kappaleittainen segmentointi.

source: Your project does not contain any files in a supported file format.
fi: Projektissa ei ole tiedostoja, joiden tiedostomuotoja tuetaan.

source: ZIP files
fi: ZIP-tiedostot

source: Zhuang, Chuang
fi: zhuang

source: all matching segments
fi: kaikki osuvat segmentit

source: attributes.
fi: attribuutteja.

source: en
fi: fi

source: etc...
fi: jne.

source: file names
fi: tiedostonimet

source: for instance from .txt to .jp for Japanese plain texts: in the Text files section of the file filters dialog, add new Source Filename Pattern (*.jp for this example) and select the appropriate parameters for the source and target encoding
fi: Esimerkiksi japaninkielisten tekstitiedostojen .txt-tunniste vaihdetaan .jp-muotoon näin: Valitse Asetukset > Tiedostosuodattimet > valintaikkunan kohtpa Teksti. Lisää uusi Lähdetiedoston muoto (tässä esimerkissä *.jp) ja määritä sopivat asetukset lähde- ja kohdetiedostokohtiin.

source: init <source language> <target language> Initialize a minimal team project with the specified languages.
fi: init <lähdekieli> <kohdekieli> Alustaa yksinkertaisen ryhmäprojektin, jossa käytetään kyseisiä kieliä.

source: lep, lepa, lepo - singular, masculine, feminine, neutral
fi: lep, lepa, lepo – yksikön maskuliini, feminiini ja neutri

source: loaded
fi: ladattu

source: move to the beginning of the line in the segment
fi: siirtyy segmentissä rivin alkuun

source: move to the end of the line in the segment
fi: siirtyy segmentissä rivin loppuun

source: move to the end of the segment
fi: siirtyy segmentin loppuun

source: move to the first segment of the document (Mac: Cmd+PgUp)
fi: siirtyy asiakirjan ensimmäiseen segmenttiin (Mac: Cmd + PgUp)

source: move to the last segment of the document (Mac: Cmd+PgDn)
fi: siirtyy asiakirjan viimeiseen segmenttiin (Mac: Cmd + PgDn)

source: move to the start of the segment
fi: siirtyy segmentin alkuun

source: najlepših - superlative, plural, genitive for M,F,N
fi: najlepših – superlatiivi, monikko, genetiivi (m, f. ja n.)

source: one char left, but not further than the beginning of segment
fi: yhden merkin verran vasemmalle, kuitenkin korkeintaan segmentin alkuun saakka

source: one char right, but not further than the end of segment
fi: yhden merkin verran oikealle, kuitenkin korkeintaan segmentin loppuun saakka

source: one word left, but not further than the beginning of segment
fi: yhden sanan verran vasemmalle, kuitenkin korkeintaan segmentin alkuun saakka

source: one word right, but not further than the end of segment
fi: yhden sanan verran oikealle, kuitenkin korkeintaan segmentin loppuun saakka

source: open Auto-completer dialog box with contextual suggestions (Mac: Esc).
fi: avaa automaattisen korvauksen valintaikkunan ehdotuksineen ((Mac: Esc).

source: open previous segment (Mac: Cmd+Enter)
fi: avaa edellisen segmentin (Mac: Cmd + Enter)

source: open your source file in a text editor that correctly interprets its encoding and save the file in "UTF-8" encoding.
fi: Avaa lähdetiedosto tekstieditorissa, joka tunnistaa käytetyn merkistökoodauksen, ja tallenna tiedosto käyttämällä UTF-8-merkistökoodausta.

source: page down through the document
fi: sivun verran alemmas asiakirjassa

source: page up through the document
fi: sivun verran ylemmäs asiakirjassa

source: remove char after cursor
fi: poistaa kohdistimen jälkeisen merkin

source: remove char before cursor
fi: poistaa ennen kohdistinta olevan merkin

source: remove chars up to the start of next word (Mac: Alt+Delete)
fi: poistaa kohdistimen jälkeiset merkit seuraavan sanan alkuun saakka (Mac: Alt + Delete)

source: remove chars up to the start of the current word (Mac: Alt+Backspace)
fi: poistaa sanasta kohdistinta edeltävät merkit (Mac: Alt + Backspace)

source: segment 0000
fi: segmentti 0000

source: select complete segment (Mac: Cmd+A)
fi: valitsee koko segmentin (Mac: Cmd + A)

source: unknown
fi: tuntematon

source: wo
fi: työtilaus

source: {0} ({1} left) / {2} ({3} left), {4}
fi: {0} ({1} jäljellä) / {2} ({3} jäljellä), {4}

source: {0} +{1} more
fi: {0} +{1} lisää

source: {0} conflicts
fi: {0} ristiriitaa

source: {0} is not a local working copy, skipping.
fi: {0} ei ole paikallinen työkopio, ohitetaan.

source: {0} segments
fi: {0} segmenttiä

source: {0}: cleanup done!!
fi: {0}: Siistitty!!

source: ← Back
fi: ← Edellinen
